backend/app/controllers/calendar_events_controller.rb

SELECT `calendar_events`.* FROM `calendar_events` WHERE `calendar_events`.`user_id` = 1
---
    def index
        user_id = current_user.id
        calendar_events = CalendarEvent.where(user_id: user_id)

INSERT INTO `calendar_events` (`title`, `description`, `start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES ('テスト', 'テストです', '2023-08-24', '', 1, '2023-08-24 07:56:06.361216', '2023-08-24 07:56:06.361216')
---
    def create
        calendar_event = CalendarEvent.new(calendar_event_params)
        calendar_event.user_id = current_user.id
        calendar_event.save!

SELECT `calendar_events`.* FROM `calendar_events` WHERE `calendar_events`.`id` = 2 LIMIT 1
UPDATE `calendar_events` SET `calendar_events`.`end_date` = '2023-08-26', `calendar_events`.`updated_at` = '2023-08-24 08:05:45.490968' WHERE `calendar_events`.`id` = 2
---
    def update
        calendar_event = CalendarEvent.find(params[:id])
        calendar_event = calendar_event.update!(calendar_event_params)

SELECT `calendar_events`.* FROM `calendar_events` WHERE `calendar_events`.`id` = 1 LIMIT 1
DELETE FROM `calendar_events` WHERE `calendar_events`.`id` = 1
---
    def delete
        calendar_event = CalendarEvent.find(params[:id])
        calendar_event = calendar_event.destroy!